Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core1/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO8_14 (coord R10), U388M[R10]/U9[5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PERIPHERAL LP_FLEXCOMM19
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_SIGNAL P0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_14_FC19_RXD_PIN_MASK (1U << 14U)
/* @} */

/*! @name PIO8_15 (coord T10), U388M[T10]/U9[6]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PERIPHERAL LP_FLEXCOMM19
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_SIGNAL P1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SENSE_RT_P8_15_FC19_TXD_PIN_MASK (1U << 15U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins_Sense(void); /* Function assigned for the Cortex-M33 (Core #1) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC4 0x04u            /*!<@brief Selects pin function 4 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO8_20 (coord T8), U388M[T8]/JP44[1]/J48[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI3CPINS_SENSE_I3C3_PUR_PERIPHERAL I3C3
/*!
 * @brief Signal name */
#define BOARD_INITI3CPINS_SENSE_I3C3_PUR_SIGNAL PUR
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_SENSE_I3C3_PUR_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITI3CPINS_SENSE_I3C3_PUR_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI3CPINS_SENSE_I3C3_PUR_PIN_MASK (1U << 20U)
/* @} */

/*! @name PIO8_21 (coord R9), U388M[R9]/U1[1]/J48[5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI3CPINS_SENSE_I3C3_SDA_PERIPHERAL I3C3
/*!
 * @brief Signal name */
#define BOARD_INITI3CPINS_SENSE_I3C3_SDA_SIGNAL SDA
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_SENSE_I3C3_SDA_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITI3CPINS_SENSE_I3C3_SDA_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI3CPINS_SENSE_I3C3_SDA_PIN_MASK (1U << 21U)
/* @} */

/*! @name PIO8_22 (coord N9), U388M[N9]/J48[3]/U1[2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI3CPINS_SENSE_I3C3_SCL_PERIPHERAL I3C3
/*!
 * @brief Signal name */
#define BOARD_INITI3CPINS_SENSE_I3C3_SCL_SIGNAL SCL
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI3CPINS_SENSE_I3C3_SCL_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITI3CPINS_SENSE_I3C3_SCL_PIN 22U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI3CPINS_SENSE_I3C3_SCL_PIN_MASK (1U << 22U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI3CPins_Sense(void); /* Function assigned for the Cortex-M33 (Core #1) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO8_6 (coord T13), U388M[T13]/Q5[2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PERIPHERAL GPIO8
/*!
 * @brief Signal name */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_CHANNEL 6

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_GPIO GPIO8
/*!
 * @brief GPIO pin mask */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_GPIO_PIN_MASK (1U << 6U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PIN 6U
/*!
 * @brief PORT pin mask */
#define BOARD_INITLEDSPINS_SENSE_P8_6_PWM_RED_LED_PIN_MASK (1U << 6U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins_Sense(void); /* Function assigned for the Cortex-M33 (Core #1) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO8_5 (coord U13), U388M[U13]/SW6[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PERIPHERAL GPIO8
/*!
 * @brief Signal name */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_CHANNEL 5

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_GPIO GPIO8
/*!
 * @brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PORT 8U
/*!
 * @brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITBUTTONSPINS_SENSE_USER_Button3_PIN_MASK (1U << 5U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins_Sense(void); /* Function assigned for the Cortex-M33 (Core #1) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
